{
  "posts": [
    {
      "author": 1,
      "content": "<p>Visit the website and review the plant vocabulary prior to starting the unofficial field trip about horticulture at Epcot.</p>\n<p>&nbsp;</p>\n<p><a title=\"Plant Vocab\" href=\"http://quizlet.com/11872022/plant-vocabulary-words-flash-cards/\" target=\"_blank\">http://quizlet.com/11872022/plant-vocabulary-words-flash-cards/</a></p>\n",
      "date": "2015-01-25T15:22:18",
      "date_gmt": "2015-01-25T15:22:18",
      "excerpt": "<p>Visit the website and review the plant vocabulary prior to starting the unofficial field trip about horticulture at Epcot. &nbsp; http://quizlet.com/11872022/plant-vocabulary-words-flash-cards/</p>\n",
      "id": 257,
      "link": "http://www.stemtechteacher.com/unofficial-field-trip/plant-vocabulary/",
      "modified": "2015-01-25T15:34:21",
      "modified_gmt": "2015-01-25T15:34:21",
      "slug": "plant-vocabulary",
      "status": "publish",
      "title": "Plant Vocabulary",
      "type": "post"
    },
    {
      "author": 1,
      "content": "<p>The Land&#8217;s entry mosaics are each 134 feet long with 150,000 individually shaped pieces of marble, granite, slate, glass and gold to represent the layers of the Earth that lead to the Great Hall. A husband and wife team created the mosaics.</p>\n<p>What do you think the layers represent?</p>\n<p>Why aren&#8217;t they straight?</p>\n<p>Read more about the mosaic here: <a title=\"Background\" href=\"http://www.scharffandscharff.com/aboutus.htm\" target=\"_blank\">http://www.scharffandscharff.com/aboutus.htm</a></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n",
      "date": "2015-01-25T04:10:04",
      "date_gmt": "2015-01-25T04:10:04",
      "excerpt": "<p>The Land&#8217;s entry mosaics are each 134 feet long with 150,000 individually shaped pieces of marble, granite, slate, glass and gold to represent the layers of the Earth that lead to the Great Hall. A husband and wife team created the mosaics. What do you think the layers represent? Why aren&#8217;t they straight? Read more &hellip; <a href=\"http://www.stemtechteacher.com/unofficial-field-trip/living-with-the-land-building/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Living with the Land Building</span> <span class=\"meta-nav\">&rarr;</span></a></p>\n",
      "id": 255,
      "link": "http://www.stemtechteacher.com/unofficial-field-trip/living-with-the-land-building/",
      "modified": "2015-01-25T15:31:26",
      "modified_gmt": "2015-01-25T15:31:26",
      "slug": "living-with-the-land-building",
      "status": "publish",
      "title": "Living with the Land Building",
      "type": "post"
    },
    {
      "author": 1,
      "content": "<p>This is a special guided walking tour of the greenhouse areas. Land scientists or a member of the College Horticultural team meet groups of up to 12 throughout the day for a 60-minute tour of the growing areas and research labs. You can ask questions and take a closer look at environmentally friendly technologies such as integrated pest management. You must sign-up for the tour, at the Green Thumb Emporium on the pavilion’s ground floor. Arrive early since the tour will book up before noon. $18/per adult and $14/per child (3-9). Reservations can be made up to one year in advance.</p>\n",
      "date": "2015-01-25T03:51:54",
      "date_gmt": "2015-01-25T03:51:54",
      "excerpt": "<p>This is a special guided walking tour of the greenhouse areas. Land scientists or a member of the College Horticultural team meet groups of up to 12 throughout the day for a 60-minute tour of the growing areas and research labs. You can ask questions and take a closer look at environmentally friendly technologies such &hellip; <a href=\"http://www.stemtechteacher.com/unofficial-field-trip/behind-the-seeds/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Behind the Seeds</span> <span class=\"meta-nav\">&rarr;</span></a></p>\n",
      "id": 253,
      "link": "http://www.stemtechteacher.com/unofficial-field-trip/behind-the-seeds/",
      "modified": "2015-01-25T15:29:24",
      "modified_gmt": "2015-01-25T15:29:24",
      "slug": "behind-the-seeds",
      "status": "publish",
      "title": "Behind the Seeds",
      "type": "post"
    },
    {
      "author": 1,
      "content": "<p>It is a wide-screen movie about the environment and our relationship with the land, hosted by the stars of The Lion King.  All set to build Hakuna Matata Vacation Resort, Pumbaa and Timon are damming rivers and cutting down trees. Simba steps in to remind them, and us, to take care of our environment.  Scenes were filmed in over 30 countries.</p>\n<p>What should you think about when building a new resort or even a school?</p>\n<p>How would building new communities affect the environment?</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n",
      "date": "2015-01-25T03:49:29",
      "date_gmt": "2015-01-25T03:49:29",
      "excerpt": "<p>It is a wide-screen movie about the environment and our relationship with the land, hosted by the stars of The Lion King.  All set to build Hakuna Matata Vacation Resort, Pumbaa and Timon are damming rivers and cutting down trees. Simba steps in to remind them, and us, to take care of our environment.  Scenes &hellip; <a href=\"http://www.stemtechteacher.com/unofficial-field-trip/circle-of-life/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Circle of Life</span> <span class=\"meta-nav\">&rarr;</span></a></p>\n",
      "id": 251,
      "link": "http://www.stemtechteacher.com/unofficial-field-trip/circle-of-life/",
      "modified": "2015-01-25T15:32:44",
      "modified_gmt": "2015-01-25T15:32:44",
      "slug": "circle-of-life",
      "status": "publish",
      "title": "Circle of Life",
      "type": "post"
    },
    {
      "author": 1,
      "content": "<p>Tropics Greenhouse: crops such as rice, sugarcane, peanuts, cacao, and bananas are usually grown under the 60 foot down. These crops can be found in southeast Asia, Africa, Latin America, and the southern United States.</p>\n<p>How do these crops compare to what you see at your dinner table?</p>\n<p>What crops do you see in the Tropics Greenhouse?</p>\n<p>Aquacell: The crops include fish, alligators, catfish, tilapia, sunshine bass, and American eel.</p>\n<p>Why do you think these crops are included in the Living with the Land attraction?</p>\n<p>Production Greenhouse: The crops like tomatoes, peppers, lettuce, and other vegetables are grown for use in The Lands Garden Grove restaurant and other Epcot restaurants. Land scientists utilize growing systems that are kinder to the environment and improve productivity.</p>\n<p>Why would Epcot want to grow their own food?</p>\n<p>Creative House: This area shows imaginative ways to grow crops, like without soil, hanging in the air, and on the space station. USDA scientists currently are working at the land to develop fruit with a longer shelf life.</p>\n<p>Why would they need to go grow crops on the space station?</p>\n",
      "date": "2015-01-25T03:32:49",
      "date_gmt": "2015-01-25T03:32:49",
      "excerpt": "<p>Tropics Greenhouse: crops such as rice, sugarcane, peanuts, cacao, and bananas are usually grown under the 60 foot down. These crops can be found in southeast Asia, Africa, Latin America, and the southern United States. How do these crops compare to what you see at your dinner table? What crops do you see in the &hellip; <a href=\"http://www.stemtechteacher.com/plants/living-with-the-land/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Living with the Land</span> <span class=\"meta-nav\">&rarr;</span></a></p>\n",
      "id": 249,
      "link": "http://www.stemtechteacher.com/plants/living-with-the-land/",
      "modified": "2015-01-25T03:32:49",
      "modified_gmt": "2015-01-25T03:32:49",
      "slug": "living-with-the-land",
      "status": "publish",
      "title": "Living with the Land",
      "type": "post"
    },
    {
      "author": 1,
      "content": "<p>Just off the lobby in the Villas at Disney&#8217;s Wilderness Lodge, is the Carolwood Pacific Room. The room is a dedication to Walt Disney&#8217;s love of the railroad, with photographs on the walls are showing him with various trains. In 1950, Walt Disney built a scaled-down railroad in the backyard of his Los Angeles home.  Named the Carolwood Pacific Railroad, with its locomotive named Lillie Belle, in honor of his wife Lillian, Walt Disney entertained family and friends with his minature railroad. On loan from the Walt Disney family foundation are two original pieces of that train, the cattle car and a gondola car, along with a piece of the authentic track.</p>\n<p>Carolwood Pacific Railroad is said to give Walt Disney the idea of creating Disney theme parks or entertaining guests on a broader scale.</p>\n<p>When he opened his first theme park in California 1955, Walt Disney said, &#8220;I want it to look like nothing else and it should be surrounded by a train.&#8221;</p>\n",
      "date": "2014-12-13T19:29:07",
      "date_gmt": "2014-12-13T19:29:07",
      "id": 58,
      "link": "http://www.stemtechteacher.com/northwest/carolwood-pacific-room/",
      "modified": "2017-11-25T02:12:05",
      "modified_gmt": "2017-11-25T02:12:05",
      "slug": "carolwood-pacific-room",
      "status": "publish",
      "title": "Carolwood Pacific Room",
      "type": "post"
    },
    {
      "author": 1,
      "content": "<p>The rustic resort is reminiscent of  late 1800s hotels built along the completion of the transcontinental railroad, as settlers traveled to the Northwest. It was designed by Urban Design Group of Denver, Colorado, headed by architect Peter Dominic, Jr. It is 200,000 ft.² with 181 rooms including studios, one, and two bedroom units for the Disney Vacation Club.</p>\n<p>When the East met the West with the completion of the rail line, it opened up a whole lot of opportunity to see the serenity and beauty along with adventure of the great outdoors, Railroad Hotels provided the first lodging in this new frontier. As if the elements were found right in the Northwest, the exterior is a stone foundation with lower Cedar Shake and upper Board and Batten siding. The interior, with post and beam engineering style made of Lodgepole Pine Logs, is a simple construction technique representing the fast pace, Rough-Rider era.</p>\n<p>The five story atrium lobby has an octagon shape in tribute to railroad industries roundhouse, a method of moving rolling stock from one line to another.</p>\n<p>The early settlers of the American West established a tradition of craftsmanship which often is characterized as Folk Art.  This rustic detailing can be found in the wood carvings in the lobby portraying the wildlife found in the west from the American grizzly to the salmon. Native American storytelling is found drawn along the first banister by placing the seasonal moons in relationship to the four compass points; North equals winter and south equals summer.</p>\n<p>Outside on the porch, the furniture portrays a style as if made from sticks or natural elements. Inside, tables give the illusion that they were all handmade with different poles of wood. The lobby and rooms have mixed-matched furniture and also use calicoes and broadcloth fabrics to represent many of the early settlers&#8217; materials from the East.  They brought their own materials with them, but they left behind the old stuff as a start a new life in the west.</p>\n",
      "date": "2014-12-13T19:22:42",
      "date_gmt": "2014-12-13T19:22:42",
      "excerpt": "<p>The rustic resort is reminiscent of  late 1800s hotels built along the completion of the transcontinental railroad, as settlers traveled to the Northwest. It was designed by Urban Design Group of Denver, Colorado, headed by architect Peter Dominic, Jr. It is 200,000 ft.² with 181 rooms including studios, one, and two bedroom units for the &hellip; <a href=\"http://www.stemtechteacher.com/northwest/villas-at-disneys-wilderness-lodge/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Villas at Disney&#8217;s Wilderness Lodge</span> <span class=\"meta-nav\">&rarr;</span></a></p>\n",
      "id": 56,
      "link": "http://www.stemtechteacher.com/northwest/villas-at-disneys-wilderness-lodge/",
      "modified": "2017-11-25T02:43:36",
      "modified_gmt": "2017-11-25T02:43:36",
      "slug": "villas-at-disneys-wilderness-lodge",
      "status": "publish",
      "title": "Villas at Disney&#8217;s Wilderness Lodge",
      "type": "post"
    },
    {
      "author": 1,
      "content": "<p>Add the two totem poles in the lobby, the Raven and the Eagle, plus the character totem pole in front of the Wildness Mercantile merchandise shop and you would have a structure as tall as a Disney&#8217;s Hollywood Studios &#8220;Earffel Tower&#8221; which is close to 130 feet tall.</p>\n<p>Many myths and legends of the Native Americans were larger than life and so were the totems they carved to play homage to the symbols of their family clans. The Wilderness Lodge paid homage as well with two towering 55 foot totems known as Raven Pole and Eagle Pole. While the figures on these totems were not meant to be specific to any of the tribes, they are common to many tribes of the great Northwest.</p>\n<p>Artist Duane Pasco from Washington state, with the help of three assistants, created both the Raven and Eagle Totem Poles within six months time. The Poles are made from Dead Wood Cedars, and are each about 15 feet in diameter at the base. The sections were spliced up the middle to create the form. To get the overall height, each pole is made up of two Cedars on top of each other. As was expected, because there was considerable heart-rot inside, they had to be hollowed out, so Pasco reinforced the centers by splicing in new wood. When he finished, he had half-cylinders that were about 4 inches thick on each edge and about 1 foot thick in the center.</p>\n<p>Pasco and his assistants began cutting away material with chainsaws. But soon, they were working with tools capable of much finer details: adzes, knives, and other traditional carving tools. After the polls were carved, they were finished with water seal and then painted. Shipped from the state of Washington and in four sections, it took five days to install and they are attached to two opposite sides but not directly across from each other of the open atrium lobby.</p>\n<p>The Raven Pole culminates with the story of how the Raven pulled the moon, the stars, and the sun from the box to light up the world of darkness. At the bottom sits Whale Chief, whom, according to some myths, held an archery contest with a tiny Wren won the hand of the Whale Chief&#8217;s beautiful daughter, dolphin. You also find the supernatural cubs of Hooits, the Bear Chief. These two had the power to live as bears or humans, but whenever disguised as humans, they held the faces of small bears in their hands. Did you ever wonder why salmon return to the very river where they were born? Well, as Raven Pole explains, it&#8217;s because Frog, the Great Communicator, called them back to lay their eggs and be treated kindly by humans.</p>\n<p>At the bottom of the Eagle Pole, you can see bear cub emerging between the ears of Bear Chief, symbolizing, that in the Indian cultures, young ones are traditionally trained by their uncles. Above, Klu-kun, the mountain goat, protects the shield of copper, which Northwestern Indians considered the highest form of wealth. Mouse woman, peering from her home, is believed protect young people. In this myth, the raven released the first tiny humans by opening a clamshell with its powerful beak. Above Raven  sits beaver, the symbol of hard-working builders in the top of the Pole is Eagle, a helper to both animals and humans. Eagle, as protector, is aided by three watchmen, known as Teen-skeel, who keep their eyes open day and night, protecting all the village houses.</p>\n",
      "date": "2014-12-13T19:01:04",
      "date_gmt": "2014-12-13T19:01:04",
      "excerpt": "<p>Add the two totem poles in the lobby, the Raven and the Eagle, plus the character totem pole in front of the Wildness Mercantile merchandise shop and you would have a structure as tall as a Disney&#8217;s Hollywood Studios &#8220;Earffel Tower&#8221; which is close to 130 feet tall. Many myths and legends of the Native Americans were larger than &hellip; <a href=\"http://www.stemtechteacher.com/northwest/totem-poles/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Totem Poles</span> <span class=\"meta-nav\">&rarr;</span></a></p>\n",
      "id": 54,
      "link": "http://www.stemtechteacher.com/northwest/totem-poles/",
      "modified": "2017-11-25T02:53:56",
      "modified_gmt": "2017-11-25T02:53:56",
      "slug": "totem-poles",
      "status": "publish",
      "title": "Totem Poles",
      "type": "post"
    },
    {
      "author": 1,
      "content": "<p>An essential task of the Plains Indian woman was the dressing of hides. The articles made of hides-buffalo, elk, deer, antelope, and smaller game-made up the majority of the tribes earthly possessions.</p>\n<p>The tanning process began immediately after a successful hunt. The fresh skin was stretched out on the ground, hairy side down. If the hide was intended for winter wear, the hair was left in place. If it was intended to be used for summer clothing or tepee making, the hair was scraped off. The tanning fluid is basically a concoction of the brains, liver, and fat of the animal. However, the softening of the skin was accomplished less by any chemical action than by flexing and by stretching many times through a hole in a buffalo shoulder-blade bone. Finally, after drying, the hide was smoked over a fire. It usually took a Native American woman about six days to complete the tanning.  However, this might be only the beginning of her work, for the hide was likely to be cut up and stitched into any number of articles and then decorated with porcupine quills, beads, and other ornaments.</p>\n",
      "date": "2014-12-13T18:29:21",
      "date_gmt": "2014-12-13T18:29:21",
      "excerpt": "<p>An essential task of the Plains Indian woman was the dressing of hides. The articles made of hides-buffalo, elk, deer, antelope, and smaller game-made up the majority of the tribes earthly possessions. The tanning process began immediately after a successful hunt. The fresh skin was stretched out on the ground, hairy side down. If the hide was intended &hellip; <a href=\"http://www.stemtechteacher.com/northwest/hides/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Hides</span> <span class=\"meta-nav\">&rarr;</span></a></p>\n",
      "id": 52,
      "link": "http://www.stemtechteacher.com/northwest/hides/",
      "modified": "2017-11-25T02:56:04",
      "modified_gmt": "2017-11-25T02:56:04",
      "slug": "hides",
      "status": "publish",
      "title": "Hides",
      "type": "post"
    },
    {
      "author": 1,
      "content": "<p>This dress was worn by a Plains tribes woman circa 1875, it has been attributed to both Kiowa and Arapaho tribes. The elk teeth are a great display of wealth, as the teeth could only be acquired only through warrior trades and were very difficult to come by. The dress was made of red and wool blanket or Shroud Cloth, a decorative and desirable fabric; it was warm for ceremony or dancing and almost certainly belong to a warriors wife.</p>\n",
      "date": "2014-12-13T18:16:27",
      "date_gmt": "2014-12-13T18:16:27",
      "excerpt": "<p>This dress was worn by a Plains tribes woman circa 1875, it has been attributed to both Kiowa and Arapaho tribes. The elk teeth are a great display of wealth, as the teeth could only be acquired only through warrior trades and were very difficult to come by. The dress was made of red and wool blanket or Shroud &hellip; <a href=\"http://www.stemtechteacher.com/northwest/elk-tooth-dress/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Elk Tooth Dress</span> <span class=\"meta-nav\">&rarr;</span></a></p>\n",
      "id": 50,
      "link": "http://www.stemtechteacher.com/northwest/elk-tooth-dress/",
      "modified": "2017-11-25T02:57:28",
      "modified_gmt": "2017-11-25T02:57:28",
      "slug": "elk-tooth-dress",
      "status": "publish",
      "title": "Elk Tooth Dress",
      "type": "post"
    },
    {
      "author": 1,
      "content": "<p>Disney&#8217;s Wilderness Lodge headdress collection consists of four headdresses:</p>\n<ul>\n<li>Double Trailer: Eagle feathers circa 1875. Red Cloud. This is the highest ranking headdress-the most elaborate-of the Sioux tribe.</li>\n<li>Feather Duster: Rooster feathers circa 1890. Crow. Trading post headband shows mountains and trails a personal significance of the warrior. Red on the feathers indicates war honor.</li>\n<li>Ermine-Tipped Raven: Inspiration for this headdress is the watercolor by Charles Bodmer, which is located in the fourth floor lobby elevators atrium, rendered in the 1830s during expedition led by Prince Maximillion to the American west.</li>\n<li>Single Trailer: Split Horn circa 1835. This headdress belonged to Mato-Tope of the Mandan Tribe. The Eagle feather signifies war honor. The knife indicates wounded in battle in hand-to-hand combat. The brass spots on the red trade cloth could signify times wounded by gunshots. The headdress exemplifies the fashion of the day for a high ranking warrior chief.</li>\n</ul>\n",
      "date": "2014-12-13T18:13:23",
      "date_gmt": "2014-12-13T18:13:23",
      "excerpt": "<p>Disney&#8217;s Wilderness Lodge headdress collection consists of four headdresses: Double Trailer: Eagle feathers circa 1875. Red Cloud. This is the highest ranking headdress-the most elaborate-of the Sioux tribe. Feather Duster: Rooster feathers circa 1890. Crow. Trading post headband shows mountains and trails a personal significance of the warrior. Red on the feathers indicates war honor. Ermine-Tipped &hellip; <a href=\"http://www.stemtechteacher.com/northwest/headdresses/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Headdresses</span> <span class=\"meta-nav\">&rarr;</span></a></p>\n",
      "id": 48,
      "link": "http://www.stemtechteacher.com/northwest/headdresses/",
      "modified": "2017-11-25T02:59:39",
      "modified_gmt": "2017-11-25T02:59:39",
      "slug": "headdresses",
      "status": "publish",
      "title": "Headdresses",
      "type": "post"
    },
    {
      "author": 1,
      "content": "<p>Within the first few weeks after the birth of her baby, the Native American mother would begin to lace him or her into a cradleboard, a wooden frame with a soft skin pouch, which could be carried on the woman&#8217;s back.  The cradleboard was a versatile device. It could be hooked onto a saddle or strapped to a travois; it could be hung up inside a tepee or, if the mother was working outdoors, leaned against the lodge covering.   In any of these positions, it had one advantage over the settlers crib or baby carriage: long before he or she could set up, the Native American baby was able to see and view the world and the coming and goings of other people in an upright posture. Even when the baby was not on the board, it was often upright, for its mother might carry it on her back in a blanket. The cradleboard was usually made by a close family member in exchange for a horse or other valuable item. The wooden frame of the cradleboard was constructed to protect the baby should it fall.  Disney&#8217;s Wilderness Lodge&#8217;s collection of cradleboard consists of a sampling of the craftsmanship and technique from a number of Native American Indian tribes. Facing the front desk area, the tribes are presented are from left to right: Crow, Apache, Arapahoe, Cheyenne, Ute, Kiowa, Navajo, and Comanche.</p>\n",
      "date": "2014-12-13T17:55:11",
      "date_gmt": "2014-12-13T17:55:11",
      "excerpt": "<p>Within the first few weeks after the birth of her baby, the Native American mother would begin to lace him or her into a cradleboard, a wooden frame with a soft skin pouch, which could be carried on the woman&#8217;s back.  The cradleboard was a versatile device. It could be hooked onto a saddle or strapped &hellip; <a href=\"http://www.stemtechteacher.com/northwest/cradleboards/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Cradleboards</span> <span class=\"meta-nav\">&rarr;</span></a></p>\n",
      "id": 43,
      "link": "http://www.stemtechteacher.com/northwest/cradleboards/",
      "modified": "2017-11-25T03:02:26",
      "modified_gmt": "2017-11-25T03:02:26",
      "slug": "cradleboards",
      "status": "publish",
      "title": "Cradleboards",
      "type": "post"
    },
    {
      "author": 1,
      "content": "<p>There are artifacts from a variety of Native American tribes, including the Cheyenne, Crow, Sioux, and Blackfoot, that have been studied, recreated, and are on display throughout the lodge.  Settlers, amazed by the Native Americans&#8217; craft and design capabilities, often asked them where they obtain their patterns for the many designs are used on leggings, armbands, moccasins, etc., and how they transformed the patterns to the skins.  It was a question that often puzzled the Native American women, for the designs were simply in their own minds; they never had patterns.  They just worked them out as they went along, and they were always in perfect balance.</p>\n<p>Head Dresses: Head dresses, like all of the other objects used and worn by the Native Americans, had to express their beliefs and assist them in the accomplishments of their goals. It was believed that a person acquired the powers of animals, birds, objects, and the elements by wearing or carrying these things. To gather additional wisdom, the wearer was advised to reflect on the spirits of the animals and birds and imitate their ways of life.</p>\n<p>The shape of a headdress was created to express its purpose. Four types, or styles, of headdresses were worn by the Mystic Warriors of the plains. There was the horned headdress, the golden eagle feather headdress, the hat or cap, which was a smaller type of covering than the horn or feathered bonnets, and the animal skin type, which employed the animal&#8217;s skin in something akin to its natural state. All other varieties could be placed in subdivisions of one or the other of these categories.</p>\n<p>The buffalo horn headdress is less well-known today than the regal eaglefeather bonnet, yet it held the highest position in the eyes the Native American warriors. The Eaglefeather bonnet was composed of individual feathers each with a distinct reference to the deeds of its warrior-owner. The Buffalo horn headdress was worn only during certain ceremonies. According to George Catlin, a survey artist who did many illustrations inspired by the North American Indians he encountered in expeditions West, only a few of the highest ranking warriors in each band were given the right to wear one by the village leaders.</p>\n<p>&nbsp;</p>\n",
      "date": "2014-12-13T17:49:15",
      "date_gmt": "2014-12-13T17:49:15",
      "excerpt": "<p>There are artifacts from a variety of Native American tribes, including the Cheyenne, Crow, Sioux, and Blackfoot, that have been studied, recreated, and are on display throughout the lodge.  Settlers, amazed by the Native Americans&#8217; craft and design capabilities, often asked them where they obtain their patterns for the many designs are used on leggings, armbands, &hellip; <a href=\"http://www.stemtechteacher.com/northwest/artifacts/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Native American Artifacts</span> <span class=\"meta-nav\">&rarr;</span></a></p>\n",
      "id": 41,
      "link": "http://www.stemtechteacher.com/northwest/artifacts/",
      "modified": "2017-11-25T03:06:33",
      "modified_gmt": "2017-11-25T03:06:33",
      "slug": "artifacts",
      "status": "publish",
      "title": "Native American Artifacts",
      "type": "post"
    },
    {
      "author": 1,
      "content": "<p>Reproductions of authentic artwork displayed throughout the lodge portrays images of exploration, hunters and trappers, American West landscapes, wildlife, and cowboy life.  Parker Blake Gallery, out of Colorado, re-created the following:</p>\n<ul>\n<li>Artist Albert Bierstadt and Thomas Moran, whose pieces are featured throughout the resort, are noted for their detailed and accurate landscape paintings.</li>\n<li>Works of cowboy painters Charles Russell and Bill Gollings are on display in the Whispering Canyon Café.</li>\n<li>Artists William Tylee Ranney and Alfred Jacob Miller accurately portray hunters and trappers, the first Easterners to cross the plains.</li>\n<li>Murals and paintings located in Artist Point Restaurant and Territory Lounge, where also on display is an authentic 34-star American flag from 1861 in Wyoming state flag from 1890, Capture the West&#8217;s wildlife, featuring Rocky Mountain sheep, elk, meal, deer, mountain goats, and moose from the works of Carl Rungius.</li>\n<li>Works by Charles Bird King and publishers McKinney-Hall portrays chiefs, Braves, and family members in a variety of poses.</li>\n</ul>\n",
      "date": "2014-12-13T17:47:56",
      "date_gmt": "2014-12-13T17:47:56",
      "excerpt": "<p>Reproductions of authentic artwork displayed throughout the lodge portrays images of exploration, hunters and trappers, American West landscapes, wildlife, and cowboy life.  Parker Blake Gallery, out of Colorado, re-created the following: Artist Albert Bierstadt and Thomas Moran, whose pieces are featured throughout the resort, are noted for their detailed and accurate landscape paintings. Works of cowboy painters &hellip; <a href=\"http://www.stemtechteacher.com/northwest/artwork/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Artwork</span> <span class=\"meta-nav\">&rarr;</span></a></p>\n",
      "id": 39,
      "link": "http://www.stemtechteacher.com/northwest/artwork/",
      "modified": "2014-12-13T20:16:25",
      "modified_gmt": "2014-12-13T20:16:25",
      "slug": "artwork",
      "status": "publish",
      "title": "Artwork",
      "type": "post"
    },
    {
      "author": 1,
      "content": "<p>Wildflowers, Deodar Cedar, and Arizona Pine are just some of the varieties that have been planted to re-create the Northwest sense of beauty.  The 150 acre property borders Bay Lake, a natural lake, where on the shore, you will find protected wetlands areas with native bald cypress trees, Slash Pines and Oaks.  The Lodgepole Pine found inside and outside of the building came from the &#8220;Standing Dead Wood&#8217; forest so no live trees were used. The hotel continues this through its operation and has a Green Lodging Certification.</p>\n<p>A bubbling hot spring in the lobby expands into a rocky, geothermal area outside the building. The water flows under a window wall to become Silvercreek and at the courtyard.  The quiet creek widens and is transformed into a roaring waterfall which plummets 15 feet past Overlook Point.</p>\n",
      "date": "2014-12-13T17:40:29",
      "date_gmt": "2014-12-13T17:40:29",
      "excerpt": "<p>Wildflowers, Deodar Cedar, and Arizona Pine are just some of the varieties that have been planted to re-create the Northwest sense of beauty.  The 150 acre property borders Bay Lake, a natural lake, where on the shore, you will find protected wetlands areas with native bald cypress trees, Slash Pines and Oaks.  The Lodgepole Pine found inside and outside of &hellip; <a href=\"http://www.stemtechteacher.com/northwest/landscaping-and-environment/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Landscaping and Environment</span> <span class=\"meta-nav\">&rarr;</span></a></p>\n",
      "id": 37,
      "link": "http://www.stemtechteacher.com/northwest/landscaping-and-environment/",
      "modified": "2017-11-25T03:09:50",
      "modified_gmt": "2017-11-25T03:09:50",
      "slug": "landscaping-and-environment",
      "status": "publish",
      "title": "Landscaping and Environment",
      "type": "post"
    },
    {
      "author": 1,
      "content": "<p>A bubbling hot spring in the lobby expands into a rocky, geothermal area outside the building. The water flows under a window wall to become Silvercreek and at the courtyard.  The quiet creek widens and is transformed into a roaring waterfall which plummets 15 feet past Overlook Point.</p>\n",
      "date": "2014-12-13T17:34:18",
      "date_gmt": "2014-12-13T17:34:18",
      "excerpt": "<p>A bubbling hot spring in the lobby expands into a rocky, geothermal area outside the building. The water flows under a window wall to become Silvercreek and at the courtyard.  The quiet creek widens and is transformed into a roaring waterfall which plummets 15 feet past Overlook Point.</p>\n",
      "id": 33,
      "link": "http://www.stemtechteacher.com/northwest/silver-creek-and-overlook-point/",
      "modified": "2014-12-13T20:38:08",
      "modified_gmt": "2014-12-13T20:38:08",
      "slug": "silver-creek-and-overlook-point",
      "status": "publish",
      "title": "Silver Creek and Overlook Point",
      "type": "post"
    },
    {
      "author": 1,
      "content": "<p>Territory Lounge celebrates exploration of the Northwestern United States, included a dedication to Lewis and Clark with the ceiling mural. The glass cabinets have exploration equipment, a tribute to President Teddy Roosevelt, photographs and negatives and early 1900s Yellowstone and Yosemite National Park, and some trapping equipment.</p>\n",
      "date": "2014-12-13T17:31:02",
      "date_gmt": "2014-12-13T17:31:02",
      "excerpt": "<p>Territory Lounge celebrates exploration of the Northwestern United States, included a dedication to Lewis and Clark with the ceiling mural. The glass cabinets have exploration equipment, a tribute to President Teddy Roosevelt, photographs and negatives and early 1900s Yellowstone and Yosemite National Park, and some trapping equipment.</p>\n",
      "id": 31,
      "link": "http://www.stemtechteacher.com/northwest/exploration/",
      "modified": "2017-11-25T03:15:59",
      "modified_gmt": "2017-11-25T03:15:59",
      "slug": "exploration",
      "status": "publish",
      "title": "Exploration",
      "type": "post"
    },
    {
      "author": 1,
      "content": "<p>Furnishings in the main lobby are inspired by the American arts and crafts movement of the early 1900s with craftsman style tables, chairs, and couches. L. and J.G. Stickley company of upstate New York popularized a style during this era called Mission Oak Furniture and in celebration of that is a collection of the Adirondack Chairs.</p>\n<p>In the Whispering Canyon Café is western style furniture popularized by Thomas Molesworth. Capturing the fun and adventure of &#8220;wild west&#8221; in the style of his furnishings, Whispering Canyon Café also celebrates the &#8220;Rough Rider&#8221; era.</p>\n",
      "date": "2014-12-13T17:29:09",
      "date_gmt": "2014-12-13T17:29:09",
      "excerpt": "<p>Furnishings in the main lobby are inspired by the American arts and crafts movement of the early 1900s with craftsman style tables, chairs, and couches. L. and J.G. Stickley company of upstate New York popularized a style during this era called Mission Oak Furniture and in celebration of that is a collection of the Adirondack Chairs. &hellip; <a href=\"http://www.stemtechteacher.com/northwest/furniture-styles/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Furniture Styles</span> <span class=\"meta-nav\">&rarr;</span></a></p>\n",
      "id": 29,
      "link": "http://www.stemtechteacher.com/northwest/furniture-styles/",
      "modified": "2014-12-13T21:24:12",
      "modified_gmt": "2014-12-13T21:24:12",
      "slug": "furniture-styles",
      "status": "publish",
      "title": "Furniture Styles",
      "type": "post"
    },
    {
      "author": 1,
      "content": "<p>Four mass of iron torch-cut chandeliers that look like suspended tepees grace the lobby. Authentic rawhide has been stressed over the lights’ framework. Inside each tepee is a 48-bulb fixture, which provides 2,880 watts to light the huge lobby. The tepees are approximately 10 feet in diameter at the base and 10 feet high at the peak. Each tepee chandelier weighs 500 pounds. The tepees are hand-painted with a geometric design. In a silhouetted style, riders on horseback and buffaloes and circle the base of each tepee chandelier. The design of the riders and animals resulted from a study of photographs. A variety of poses were selected and crafted in bronze and steel with an aged finished.</p>\n<p><a href=\"http://www.stemtechteacher.com/wp-content/uploads/2014/12/IMG_0075.jpg\"><img class=\"alignnone size-medium wp-image-111\" src=\"http://www.stemtechteacher.com/wp-content/uploads/2014/12/IMG_0075-225x300.jpg\" alt=\"IMG_0075\" width=\"225\" height=\"300\" srcset=\"http://www.stemtechteacher.com/wp-content/uploads/2014/12/IMG_0075-225x300.jpg 225w, http://www.stemtechteacher.com/wp-content/uploads/2014/12/IMG_0075.jpg 240w\" sizes=\"(max-width: 225px) 100vw, 225px\" /></a></p>\n",
      "date": "2014-12-13T17:23:34",
      "date_gmt": "2014-12-13T17:23:34",
      "excerpt": "<p>Four mass of iron torch-cut chandeliers that look like suspended tepees grace the lobby. Authentic rawhide has been stressed over the lights’ framework. Inside each tepee is a 48-bulb fixture, which provides 2,880 watts to light the huge lobby. The tepees are approximately 10 feet in diameter at the base and 10 feet high at &hellip; <a href=\"http://www.stemtechteacher.com/northwest/chandeliers/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Chandeliers</span> <span class=\"meta-nav\">&rarr;</span></a></p>\n",
      "id": 27,
      "link": "http://www.stemtechteacher.com/northwest/chandeliers/",
      "modified": "2017-11-25T03:21:52",
      "modified_gmt": "2017-11-25T03:21:52",
      "slug": "chandeliers",
      "status": "publish",
      "title": "Chandeliers",
      "type": "post"
    },
    {
      "author": 1,
      "content": "<p>A penny saved would hardly make a dent in the amount of copper used in Wilderness Lodge. All the copper used in the resort  (for decorative, yet functional, flashings and wraps around the base and tops of exposed beams) equal more than $3 million in pennies.</p>\n",
      "date": "2014-12-13T16:47:06",
      "date_gmt": "2014-12-13T16:47:06",
      "excerpt": "<p>A penny saved would hardly make a dent in the amount of copper used in Wilderness Lodge. All the copper used in the resort  (for decorative, yet functional, flashings and wraps around the base and tops of exposed beams) equal more than $3 million in pennies.</p>\n",
      "id": 18,
      "link": "http://www.stemtechteacher.com/northwest/a-penny-saved/",
      "modified": "2017-11-25T03:23:46",
      "modified_gmt": "2017-11-25T03:23:46",
      "slug": "a-penny-saved",
      "status": "publish",
      "title": "A Penny Saved",
      "type": "post"
    },
    {
      "author": 1,
      "content": "<p>The &#8220;Old Faithful&#8221; inspired fire rock geyser can shoot a water plume up to 120 feet high, at regular intervals, of course.  The geyser, locate outside between the swimming pool and Bay Lake, serves as a recreation of the famous geyser, Old Faithful. The computer controlled geyser has specific programming ability and online input adjustments for wind drift.</p>\n",
      "date": "2014-12-13T16:44:40",
      "date_gmt": "2014-12-13T16:44:40",
      "excerpt": "<p>The &#8220;Old Faithful&#8221; inspired fire rock geyser can shoot a water plume up to 120 feet high, at regular intervals, of course.  The geyser, locate outside between the swimming pool and Bay Lake, serves as a recreation of the famous geyser, Old Faithful. The computer controlled geyser has specific programming ability and online input adjustments for &hellip; <a href=\"http://www.stemtechteacher.com/northwest/making-a-splash/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Making a Splash: Fire Rock Geysor</span> <span class=\"meta-nav\">&rarr;</span></a></p>\n",
      "id": 16,
      "link": "http://www.stemtechteacher.com/northwest/making-a-splash/",
      "modified": "2017-11-25T03:27:25",
      "modified_gmt": "2017-11-25T03:27:25",
      "slug": "making-a-splash",
      "status": "publish",
      "title": "Making a Splash: Fire Rock Geysor",
      "type": "post"
    },
    {
      "author": 1,
      "content": "<p>The layered look of the three sided fireplace is no accident. The structure represents 1.6 billion years of the Grand Canyon strata, which includes fossilized remains of prehistoric animal and plant life. Display cases near the fireplace on each floor are actual rocks and fossils from the Grand Canyon area, as a floor rise, the elevation changes so do the rock formations change out.  The towering stone fireplace in the lobby stands 82 feet tall. According to artist and geological consultant Robert Reed, the fossil life recorded pre-dates the dinosaur era. As part of the re-creation, more than 100 colors, from black, green, and magenta to light buff, red, and brown, are visible in an almost unbroken sequence of deposition.  The variations are recreated as those that appear in the Grand Canyon, where each layer tapers, ranging from 50 to 700 feet.</p>\n<p><a href=\"http://www.stemtechteacher.com/wp-content/uploads/2014/12/IMG_0061.jpg\"><img class=\"alignnone size-medium wp-image-97\" src=\"http://www.stemtechteacher.com/wp-content/uploads/2014/12/IMG_0061-225x300.jpg\" alt=\"IMG_0061\" width=\"225\" height=\"300\" srcset=\"http://www.stemtechteacher.com/wp-content/uploads/2014/12/IMG_0061-225x300.jpg 225w, http://www.stemtechteacher.com/wp-content/uploads/2014/12/IMG_0061.jpg 240w\" sizes=\"(max-width: 225px) 100vw, 225px\" /></a></p>\n",
      "date": "2014-12-13T16:43:18",
      "date_gmt": "2014-12-13T16:43:18",
      "excerpt": "<p>The layered look of the three sided fireplace is no accident. The structure represents 1.6 billion years of the Grand Canyon strata, which includes fossilized remains of prehistoric animal and plant life. Display cases near the fireplace on each floor are actual rocks and fossils from the Grand Canyon area, as a floor rise, the elevation changes &hellip; <a href=\"http://www.stemtechteacher.com/northwest/the-layered-look/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">The Layered Look</span> <span class=\"meta-nav\">&rarr;</span></a></p>\n",
      "id": 14,
      "link": "http://www.stemtechteacher.com/northwest/the-layered-look/",
      "modified": "2017-11-25T03:31:31",
      "modified_gmt": "2017-11-25T03:31:31",
      "slug": "the-layered-look",
      "status": "publish",
      "title": "The Layered Look",
      "type": "post"
    },
    {
      "author": 1,
      "content": "<p>Added to totem poles in the lobby, the Raven and the Eagle, plus the character totem pole in front of the Wildness Mercantile merchandise shop and you would have a structure as tall as a Disney&#8217;s Hollywood Studios &#8220;Earffel Tower&#8221; which is close to 130 feet tall.</p>\n",
      "date": "2014-12-13T16:42:04",
      "date_gmt": "2014-12-13T16:42:04",
      "excerpt": "<p>Added to totem poles in the lobby, the Raven and the Eagle, plus the character totem pole in front of the Wildness Mercantile merchandise shop and you would have a structure as tall as a Disney&#8217;s Hollywood Studios &#8220;Earffel Tower&#8221; which is close to 130 feet tall.</p>\n",
      "id": 12,
      "link": "http://www.stemtechteacher.com/northwest/piled-high/",
      "modified": "2014-12-13T20:41:14",
      "modified_gmt": "2014-12-13T20:41:14",
      "slug": "piled-high",
      "status": "publish",
      "title": "Piled High",
      "type": "post"
    },
    {
      "author": 1,
      "content": "<p>The &#8220;Native American Carpet&#8221; floor pattern in the lobby is made up of four different types of wood: Brazilian Cherry, White Oak, Birds-Eye Maple, and Burl Walnut.  The design depicts the symbol of unity among the four seasons, wildlife, man, and the cosmos.  The quarried rock lobby floor is from the foothills of the Rocky Mountains. Consisting of cleft sandstone, Colorado Rose and Buff, and White Granite, it came from the same quarry in the state of Colorado as the front desk countertop, solid 6 inch green granite slabs.</p>\n",
      "date": "2014-12-13T16:39:54",
      "date_gmt": "2014-12-13T16:39:54",
      "excerpt": "<p>The &#8220;Native American Carpet&#8221; floor pattern in the lobby is made up of four different types of wood: Brazilian Cherry, White Oak, Birds-Eye Maple, and Burl Walnut.  The design depicts the symbol of unity among the four seasons, wildlife, man, and the cosmos.  The quarried rock lobby floor is from the foothills of the Rocky Mountains. Consisting of &hellip; <a href=\"http://www.stemtechteacher.com/northwest/four-on-the-floor/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Four on the Floor</span> <span class=\"meta-nav\">&rarr;</span></a></p>\n",
      "id": 10,
      "link": "http://www.stemtechteacher.com/northwest/four-on-the-floor/",
      "modified": "2017-11-25T03:34:13",
      "modified_gmt": "2017-11-25T03:34:13",
      "slug": "four-on-the-floor",
      "status": "publish",
      "title": "Four on the Floor",
      "type": "post"
    },
    {
      "author": 1,
      "content": "<p>The reinforced log-bundle columns bordering the lobby have a special purpose-and folklore meaning.  Not only do they hold up the lobby roof, but according to Native American legend, the bundles &#8220;hold up the heavens.&#8221;</p>\n",
      "date": "2014-12-13T16:33:06",
      "date_gmt": "2014-12-13T16:33:06",
      "excerpt": "<p>The reinforced log-bundle columns bordering the lobby have a special purpose-and folklore meaning.  Not only do they hold up the lobby roof, but according to Native American legend, the bundles &#8220;hold up the heavens.&#8221;</p>\n",
      "id": 8,
      "link": "http://www.stemtechteacher.com/northwest/bundle-up/",
      "modified": "2014-12-13T19:56:09",
      "modified_gmt": "2014-12-13T19:56:09",
      "slug": "bundle-up",
      "status": "publish",
      "title": "Bundle Up",
      "type": "post"
    },
    {
      "author": 1,
      "content": "<p>A total of eighty five truck loads of Lodgepole Pine Logs were delivering to the Wilderness Lodge from Oregon and Montana.  If placed end-to-end, the wood would stretch for forty miles.</p>\n<p><a href=\"http://www.stemtechteacher.com/wp-content/uploads/2014/12/IMG_0057.jpg\"><img class=\"alignnone size-medium wp-image-93\" src=\"http://www.stemtechteacher.com/wp-content/uploads/2014/12/IMG_0057-225x300.jpg\" alt=\"IMG_0057\" width=\"225\" height=\"300\" srcset=\"http://www.stemtechteacher.com/wp-content/uploads/2014/12/IMG_0057-225x300.jpg 225w, http://www.stemtechteacher.com/wp-content/uploads/2014/12/IMG_0057.jpg 240w\" sizes=\"(max-width: 225px) 100vw, 225px\" /></a></p>\n",
      "date": "2014-12-13T16:30:53",
      "date_gmt": "2014-12-13T16:30:53",
      "excerpt": "<p>A total of eighty five truck loads of Lodgepole Pine Logs were delivering to the Wilderness Lodge from Oregon and Montana.  If placed end-to-end, the wood would stretch for forty miles.</p>\n",
      "id": 6,
      "link": "http://www.stemtechteacher.com/uncategorized/wood-you-believe/",
      "modified": "2014-12-13T21:29:13",
      "modified_gmt": "2014-12-13T21:29:13",
      "slug": "wood-you-believe",
      "status": "publish",
      "title": "Wood You Believe",
      "type": "post"
    },
    {
      "author": 1,
      "content": "<p>Entering through the doorway of Disney&#8217;s Wilderness Lodge, guests will experience the authentic sights, sounds, tastes and aromas which bring to life the breathtaking beauty, history, and traditions of the Great Northwest.</p>\n<p>The Wilderness Lodge is a rustic resort reminiscent of early 1900s national Park Lodge is built in the Northwestern United States, with a special tribute to Native American heritage.  It was designed by urban design group of Denver, Colorado, headed by architect Peter Dominic, Jr.</p>\n<p>The building is 540,000 ft.².  There are 728 rooms including unique bunkbed style rooms and suites.</p>\n<p>U.S. President Teddy Roosevelt’s promise became a reality by protecting and preserving our nation&#8217;s natural resources. With hopes of showcasing for all generations to enjoy, new lodging was created in our national parks.</p>\n<p>Natural elements of wood, water, and stone blend together re-creating the feel of these grand lodges with the use of 85 truckloads of Lodge Pole Pine Logs that were delivered from Oregon and Montana to help in the building of this resort.  If placed end-to-end, the wood would stretch for forty miles.</p>\n<p>The atrium, or lobby, which serves as a centerpiece, is over seven stories tall.</p>\n<p>Disney Craftsman William Robertson carved Northwestern wildlife on the log bundle columns. There are 16 figures carved from Lodgepole Pine and each is placed according to its life station, with a bird of prey on the top of each column including two different looks of the American Bald Eagle. The 12 foot tall totem of Disney characters stands adjacent to Wilderness Lodge Mercantile. It took Robertson months to carve out the Lodgepole Pine intricate features of Humphrey Bear, Donald Duck, Goofy, and Mickey Mouse.</p>\n<p><img class=\"alignnone size-medium wp-image-68\" src=\"http://www.stemtechteacher.com/wp-content/uploads/2014/12/IMG_0059-225x300.jpg\" alt=\"IMG_0059\" width=\"225\" height=\"300\" srcset=\"http://www.stemtechteacher.com/wp-content/uploads/2014/12/IMG_0059-225x300.jpg 225w, http://www.stemtechteacher.com/wp-content/uploads/2014/12/IMG_0059.jpg 240w\" sizes=\"(max-width: 225px) 100vw, 225px\" /></p>\n",
      "date": "2014-12-13T16:29:33",
      "date_gmt": "2014-12-13T16:29:33",
      "excerpt": "<p>Entering through the doorway of Disney&#8217;s Wilderness Lodge, guests will experience the authentic sights, sounds, tastes and aromas which bring to life the breathtaking beauty, history, and traditions of the Great Northwest. The Wilderness Lodge is a rustic resort reminiscent of early 1900s national Park Lodge is built in the Northwestern United States, with a &hellip; <a href=\"http://www.stemtechteacher.com/northwest/tall-tales/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Entering the Northwest</span> <span class=\"meta-nav\">&rarr;</span></a></p>\n",
      "id": 4,
      "link": "http://www.stemtechteacher.com/northwest/tall-tales/",
      "modified": "2017-11-25T02:39:27",
      "modified_gmt": "2017-11-25T02:39:27",
      "slug": "tall-tales",
      "status": "publish",
      "title": "Entering the Northwest",
      "type": "post"
    }
  ]
}
