[
  {
    "id": 257,
    "date": "2015-01-25T15:22:18",
    "date_gmt": "2015-01-25T15:22:18",
    "guid": {
      "rendered": "http:\/\/www.stemtechteacher.com\/?p=257"
    },
    "modified": "2015-01-25T15:34:21",
    "modified_gmt": "2015-01-25T15:34:21",
    "slug": "plant-vocabulary",
    "status": "publish",
    "type": "post",
    "link": "http:\/\/www.stemtechteacher.com\/unofficial-field-trip\/plant-vocabulary\/",
    "title": "Plant Vocabulary",
    "content": "Visit the website and review the plant vocabulary prior to starting the unofficial field trip about horticulture at Epcot.",
    "excerpt": "Visit the website and review the plant vocabulary prior to starting the unofficial field trip about horticulture at Epcot. &nbsp; http:\/\/quizlet.com\/11872022\/plant-vocabulary-words-flash-cards\/\n",
    "author": 1,
    "tags": []
  },
  {
    "id": 255,
    "date": "2015-01-25T04:10:04",
    "date_gmt": "2015-01-25T04:10:04",
    "guid": {
      "rendered": "http:\/\/www.stemtechteacher.com\/?p=255"
    },
    "modified": "2015-01-25T15:31:26",
    "modified_gmt": "2015-01-25T15:31:26",
    "slug": "living-with-the-land-building",
    "status": "publish",
    "type": "post",
    "link": "http:\/\/www.stemtechteacher.com\/unofficial-field-trip\/living-with-the-land-building\/",
    "title": "Living with the Land Building",
    "content": "The Land's entry mosaics are each 134 feet long with 150,000 individually shaped pieces of marble, granite, slate, glass and gold to represent the layers of the Earth that lead to the Great Hall. A husband and wife team created the mosaics.\nWhat do you think the layers represent?\nWhy aren't they straight?\nRead more about the mosaic here:",
    "excerpt": "The Land's entry mosaics are each 134 feet long with 150,000 individually shaped pieces of marble, granite, slate, glass and gold to represent the layers of the Earth that lead to the Great Hall. A husband and wife team created the mosaics. What do you think the layers represent? Why aren't they straight? Read more &hellip;",
    "author": 1,
    "tags": []
  },
  {
    "id": 253,
    "date": "2015-01-25T03:51:54",
    "date_gmt": "2015-01-25T03:51:54",
    "guid": {
      "rendered": "http:\/\/www.stemtechteacher.com\/?p=253"
    },
    "modified": "2015-01-25T15:29:24",
    "modified_gmt": "2015-01-25T15:29:24",
    "slug": "behind-the-seeds",
    "status": "publish",
    "type": "post",
    "link": "http:\/\/www.stemtechteacher.com\/unofficial-field-trip\/behind-the-seeds\/",
    "title": "Behind the Seeds",
    "content": "This is a special guided walking tour of the greenhouse areas. Land scientists or a member of the College Horticultural team meet groups of up to 12 throughout the day for a 60-minute tour of the growing areas and research labs. You can ask questions and take a closer look at environmentally friendly technologies such as integrated pest management. You must sign-up for the tour, at the Green Thumb Emporium on the pavilion’s ground floor. Arrive early since the tour will book up before noon. $18\/per adult and $14\/per child (3-9). Reservations can be made up to one year in advance.\n",
    "excerpt": "This is a special guided walking tour of the greenhouse areas. Land scientists or a member of the College Horticultural team meet groups of up to 12 throughout the day for a 60-minute tour of the growing areas and research labs. You can ask questions and take a closer look at environmentally friendly technologies such &hellip; ",
    "author": 1,
    "tags": []
  },
  {
    "id": 251,
    "date": "2015-01-25T03:49:29",
    "date_gmt": "2015-01-25T03:49:29",
    "guid": {
      "rendered": "http:\/\/www.stemtechteacher.com\/?p=251"
    },
    "modified": "2015-01-25T15:32:44",
    "modified_gmt": "2015-01-25T15:32:44",
    "slug": "circle-of-life",
    "status": "publish",
    "type": "post",
    "link": "http:\/\/www.stemtechteacher.com\/unofficial-field-trip\/circle-of-life\/",
    "title": "Circle of Life",
    "content": "It is a wide-screen movie about the environment and our relationship with the land, hosted by the stars of The Lion King.  All set to build Hakuna Matata Vacation Resort, Pumbaa and Timon are damming rivers and cutting down trees. Simba steps in to remind them, and us, to take care of our environment.  Scenes were filmed in over 30 countries.\nWhat should you think about when building a new resort or even a school?\nHow would building new communities affect the environment?\n&nbsp;\n&nbsp;\n",
    "excerpt": "It is a wide-screen movie about the environment and our relationship with the land, hosted by the stars of The Lion King.  All set to build Hakuna Matata Vacation Resort, Pumbaa and Timon are damming rivers and cutting down trees. Simba steps in to remind them, and us, to take care of our environment.  Scenes &hellip;",
    "author": 1,
    "tags": []
  },
  {
    "id": 249,
    "date": "2015-01-25T03:32:49",
    "date_gmt": "2015-01-25T03:32:49",
    "guid": {
      "rendered": "http:\/\/www.stemtechteacher.com\/?p=249"
    },
    "modified": "2015-01-25T03:32:49",
    "modified_gmt": "2015-01-25T03:32:49",
    "slug": "living-with-the-land",
    "status": "publish",
    "type": "post",
    "link": "http:\/\/www.stemtechteacher.com\/plants\/living-with-the-land\/",
    "title": "Living with the Land",
    "content": "Tropics Greenhouse: crops such as rice, sugarcane, peanuts, cacao, and bananas are usually grown under the 60 foot down. These crops can be found in southeast Asia, Africa, Latin America, and the southern United States.\nHow do these crops compare to what you see at your dinner table?\nWhat crops do you see in the Tropics Greenhouse?\nAquacell: The crops include fish, alligators, catfish, tilapia, sunshine bass, and American eel.\nWhy do you think these crops are included in the Living with the Land attraction?\nProduction Greenhouse: The crops like tomatoes, peppers, lettuce, and other vegetables are grown for use in The Lands Garden Grove restaurant and other Epcot restaurants. Land scientists utilize growing systems that are kinder to the environment and improve productivity.\nWhy would Epcot want to grow their own food?\nCreative House: This area shows imaginative ways to grow crops, like without soil, hanging in the air, and on the space station. USDA scientists currently are working at the land to develop fruit with a longer shelf life.\nWhy would they need to go grow crops on the space station?\n",
    "excerpt": "Tropics Greenhouse: crops such as rice, sugarcane, peanuts, cacao, and bananas are usually grown under the 60 foot down. These crops can be found in southeast Asia, Africa, Latin America, and the southern United States. How do these crops compare to what you see at your dinner table? What crops do you see in the &hellip;",
    "author": 1,
    "tags": []
  },
  {
    "id": 58,
    "date": "2014-12-13T19:29:07",
    "date_gmt": "2014-12-13T19:29:07",
    "guid": {
      "rendered": "http:\/\/www.stemtechteacher.com\/?p=58"
    },
    "modified": "2017-11-25T02:12:05",
    "modified_gmt": "2017-11-25T02:12:05",
    "slug": "carolwood-pacific-room",
    "status": "publish",
    "type": "post",
    "link": "http:\/\/www.stemtechteacher.com\/northwest\/carolwood-pacific-room\/",
    "title": "Carolwood Pacific Room",
    "content": "Just off the lobby in the Villas at Disney's Wilderness Lodge, is the Carolwood Pacific Room. The room is a dedication to Walt Disney's love of the railroad, with photographs on the walls are showing him with various trains. In 1950, Walt Disney built a scaled-down railroad in the backyard of his Los Angeles home.  Named the Carolwood Pacific Railroad, with its locomotive named Lillie Belle, in honor of his wife Lillian, Walt Disney entertained family and friends with his minature railroad. On loan from the Walt Disney family foundation are two original pieces of that train, the cattle car and a gondola car, along with a piece of the authentic track.\nCarolwood Pacific Railroad is said to give Walt Disney the idea of creating Disney theme parks or entertaining guests on a broader scale.\nWhen he opened his first theme park in California 1955, Walt Disney said, &#8220;I want it to look like nothing else and it should be surrounded by a train.&#8221;\n",
    "excerpt": "Just off the lobby in the Villas at Disney's Wilderness Lodge, is the Carolwood Pacific Room. The room is a dedication to Walt Disney's love of the railroad, with photographs on the walls are showing him with various trains. In 1950, Walt Disney built a scaled-down railroad in the backyard of his Los Angeles home. &hellip;",
    "author": 1,
    "tags": []
  },
  {
    "id": 56,
    "date": "2014-12-13T19:22:42",
    "date_gmt": "2014-12-13T19:22:42",
    "guid": {
      "rendered": "http:\/\/www.stemtechteacher.com\/?p=56"
    },
    "modified": "2017-11-25T02:43:36",
    "modified_gmt": "2017-11-25T02:43:36",
    "slug": "villas-at-disneys-wilderness-lodge",
    "status": "publish",
    "type": "post",
    "link": "http:\/\/www.stemtechteacher.com\/northwest\/villas-at-disneys-wilderness-lodge\/",
    "title": "Villas at Disney's Wilderness Lodge",
    "content": "The rustic resort is reminiscent of  late 1800s hotels built along the completion of the transcontinental railroad, as settlers traveled to the Northwest. It was designed by Urban Design Group of Denver, Colorado, headed by architect Peter Dominic, Jr. It is 200,000 ft.² with 181 rooms including studios, one, and two bedroom units for the Disney Vacation Club.\nWhen the East met the West with the completion of the rail line, it opened up a whole lot of opportunity to see the serenity and beauty along with adventure of the great outdoors, Railroad Hotels provided the first lodging in this new frontier. As if the elements were found right in the Northwest, the exterior is a stone foundation with lower Cedar Shake and upper Board and Batten siding. The interior, with post and beam engineering style made of Lodgepole Pine Logs, is a simple construction technique representing the fast pace, Rough-Rider era.\nThe five story atrium lobby has an octagon shape in tribute to railroad industries roundhouse, a method of moving rolling stock from one line to another.\nThe early settlers of the American West established a tradition of craftsmanship which often is characterized as Folk Art.  This rustic detailing can be found in the wood carvings in the lobby portraying the wildlife found in the west from the American grizzly to the salmon. Native American storytelling is found drawn along the first banister by placing the seasonal moons in relationship to the four compass points; North equals winter and south equals summer.\nOutside on the porch, the furniture portrays a style as if made from sticks or natural elements. Inside, tables give the illusion that they were all handmade with different poles of wood. The lobby and rooms have mixed-matched furniture and also use calicoes and broadcloth fabrics to represent many of the early settlers' materials from the East.  They brought their own materials with them, but they left behind the old stuff as a start a new life in the west.\n",
    "excerpt": "The rustic resort is reminiscent of  late 1800s hotels built along the completion of the transcontinental railroad, as settlers traveled to the Northwest. It was designed by Urban Design Group of Denver, Colorado, headed by architect Peter Dominic, Jr. It is 200,000 ft.² with 181 rooms including studios, one, and two bedroom units for the &hellip;",
    "author": 1,
    "tags": []
  },
  {
    "id": 54,
    "date": "2014-12-13T19:01:04",
    "date_gmt": "2014-12-13T19:01:04",
    "guid": {
      "rendered": "http:\/\/www.stemtechteacher.com\/?p=54"
    },
    "modified": "2017-11-25T02:53:56",
    "modified_gmt": "2017-11-25T02:53:56",
    "slug": "totem-poles",
    "status": "publish",
    "type": "post",
    "link": "http:\/\/www.stemtechteacher.com\/northwest\/totem-poles\/",
    "title": "Totem Poles",
    "content": "Add the two totem poles in the lobby, the Raven and the Eagle, plus the character totem pole in front of the Wildness Mercantile merchandise shop and you would have a structure as tall as a Disney's Hollywood Studios &#8220;Earffel Tower&#8221; which is close to 130 feet tall.\nMany myths and legends of the Native Americans were larger than life and so were the totems they carved to play homage to the symbols of their family clans. The Wilderness Lodge paid homage as well with two towering 55 foot totems known as Raven Pole and Eagle Pole. While the figures on these totems were not meant to be specific to any of the tribes, they are common to many tribes of the great Northwest.\nArtist Duane Pasco from Washington state, with the help of three assistants, created both the Raven and Eagle Totem Poles within six months time. The Poles are made from Dead Wood Cedars, and are each about 15 feet in diameter at the base. The sections were spliced up the middle to create the form. To get the overall height, each pole is made up of two Cedars on top of each other. As was expected, because there was considerable heart-rot inside, they had to be hollowed out, so Pasco reinforced the centers by splicing in new wood. When he finished, he had half-cylinders that were about 4 inches thick on each edge and about 1 foot thick in the center.\nPasco and his assistants began cutting away material with chainsaws. But soon, they were working with tools capable of much finer details: adzes, knives, and other traditional carving tools. After the polls were carved, they were finished with water seal and then painted. Shipped from the state of Washington and in four sections, it took five days to install and they are attached to two opposite sides but not directly across from each other of the open atrium lobby.\nThe Raven Pole culminates with the story of how the Raven pulled the moon, the stars, and the sun from the box to light up the world of darkness. At the bottom sits Whale Chief, whom, according to some myths, held an archery contest with a tiny Wren won the hand of the Whale Chief's beautiful daughter, dolphin. You also find the supernatural cubs of Hooits, the Bear Chief. These two had the power to live as bears or humans, but whenever disguised as humans, they held the faces of small bears in their hands. Did you ever wonder why salmon return to the very river where they were born? Well, as Raven Pole explains, it's because Frog, the Great Communicator, called them back to lay their eggs and be treated kindly by humans.\nAt the bottom of the Eagle Pole, you can see bear cub emerging between the ears of Bear Chief, symbolizing, that in the Indian cultures, young ones are traditionally trained by their uncles. Above, Klu-kun, the mountain goat, protects the shield of copper, which Northwestern Indians considered the highest form of wealth. Mouse woman, peering from her home, is believed protect young people. In this myth, the raven released the first tiny humans by opening a clamshell with its powerful beak. Above Raven  sits beaver, the symbol of hard-working builders in the top of the Pole is Eagle, a helper to both animals and humans. Eagle, as protector, is aided by three watchmen, known as Teen-skeel, who keep their eyes open day and night, protecting all the village houses.\n",
    "excerpt": "Add the two totem poles in the lobby, the Raven and the Eagle, plus the character totem pole in front of the Wildness Mercantile merchandise shop and you would have a structure as tall as a Disney's Hollywood Studios &#8220;Earffel Tower&#8221; which is close to 130 feet tall. Many myths and legends of the Native Americans were larger than &hellip;",
    "author": 1,
    "tags": []
  },
  {
    "id": 52,
    "date": "2014-12-13T18:29:21",
    "date_gmt": "2014-12-13T18:29:21",
    "guid": {
      "rendered": "http:\/\/www.stemtechteacher.com\/?p=52"
    },
    "modified": "2017-11-25T02:56:04",
    "modified_gmt": "2017-11-25T02:56:04",
    "slug": "hides",
    "status": "publish",
    "type": "post",
    "link": "http:\/\/www.stemtechteacher.com\/northwest\/hides\/",
    "title": "Hides",
    "content": "An essential task of the Plains Indian woman was the dressing of hides. The articles made of hides-buffalo, elk, deer, antelope, and smaller game-made up the majority of the tribes earthly possessions.\nThe tanning process began immediately after a successful hunt. The fresh skin was stretched out on the ground, hairy side down. If the hide was intended for winter wear, the hair was left in place. If it was intended to be used for summer clothing or tepee making, the hair was scraped off. The tanning fluid is basically a concoction of the brains, liver, and fat of the animal. However, the softening of the skin was accomplished less by any chemical action than by flexing and by stretching many times through a hole in a buffalo shoulder-blade bone. Finally, after drying, the hide was smoked over a fire. It usually took a Native American woman about six days to complete the tanning.  However, this might be only the beginning of her work, for the hide was likely to be cut up and stitched into any number of articles and then decorated with porcupine quills, beads, and other ornaments.\n",
    "excerpt": "An essential task of the Plains Indian woman was the dressing of hides. The articles made of hides-buffalo, elk, deer, antelope, and smaller game-made up the majority of the tribes earthly possessions. The tanning process began immediately after a successful hunt. The fresh skin was stretched out on the ground, hairy side down. If the hide was intended &hellip;",
    "author": 1,
    "tags": []
  },
  {
    "id": 50,
    "date": "2014-12-13T18:16:27",
    "date_gmt": "2014-12-13T18:16:27",
    "guid": {
      "rendered": "http:\/\/www.stemtechteacher.com\/?p=50"
    },
    "modified": "2017-11-25T02:57:28",
    "modified_gmt": "2017-11-25T02:57:28",
    "slug": "elk-tooth-dress",
    "status": "publish",
    "type": "post",
    "link": "http:\/\/www.stemtechteacher.com\/northwest\/elk-tooth-dress\/",
    "title": "Elk Tooth Dress",
    "content": "This dress was worn by a Plains tribes woman circa 1875, it has been attributed to both Kiowa and Arapaho tribes. The elk teeth are a great display of wealth, as the teeth could only be acquired only through warrior trades and were very difficult to come by. The dress was made of red and wool blanket or Shroud Cloth, a decorative and desirable fabric; it was warm for ceremony or dancing and almost certainly belong to a warriors wife.\n",
    "excerpt": "This dress was worn by a Plains tribes woman circa 1875, it has been attributed to both Kiowa and Arapaho tribes. The elk teeth are a great display of wealth, as the teeth could only be acquired only through warrior trades and were very difficult to come by. The dress was made of red and wool blanket or Shroud &hellip;",
    "author": 1,
    "tags": []
  }
]
